---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ImageInstance
source: html/6a4190ff-3aa4-21c6-e91f-5a829fbb65c0.htm
---
# ImageInstance Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.